<?php
if( ! defined('ABSPATH') ) die();
function av_help_func(){
global $av_settings,$avEcrypt,$wpdb,$avdb;

?>
	<div class="wrap av-help">
		<h2 style="font-family:yekan,tahoma;font-weight:normal;font-size:19px;">راهنما</h2>
		<div class="clr"></div>
		
		<div class="av-help-sec">
			<div class="q">
				<p>چگونه فرم پرداخت را در سایت نمایش دهیم؟</p>
			</div>
			<div class="hdn a">
				<p>به راحتی می توانید با کد میانبر <code>[vip-payment]</code> فرم انتخاب اکانت را نمایش دهید. در نظر داشته باشید اگر در تنظیمات افزونه هیچ بازه زمانی تعریف نکرده باشید، فرم نمایش داده نمی شود.</p>
			</div>
		</div>
		
		<div class="av-help-sec">
			<div class="q">
				<p>چگونه در نوشته ها با برگه محتوای مخصوص اعضای وی آی پی قرار دهیم؟</p>
			</div>
			<div class="hdn a">
				<p>برای این کار شما دو راه دارید: <br/>
				1- ابتدا از متاباکسی که پایین هر نوشته و برگه هست گزینه "نمایش محتویات فقط به کاربران وی آی پی" را روی بله قرار دهید. البته این روش صد در صد مطمئن نیست زیر فقط محتوایی که با تابع the_content تعریف شده اند را فیلتر می کند. پس اگر می خواهید از این روش استفاده کنید، ابتدا مطمئن شوید که قالب شما برای فراخانی محتوای نوشته از تابع the_content استفاده می کند.<br/><br/>
				2- با استفاده کد میانبر <code>[vip-members] محتوا در اینجا [/vip-members]</code> محتوا را در سایت خود قرار دهید. هم چنین در نوار ویرایشگر دکمه جدیدی با نام VIP قرار دارد که می توانید ابتدا محتوای ویژه نوشته را انتخاب کنید سپس روی این دکمه کلیک کنید.<br/>
				این روش نسبت به روش اول مطمئن تر است زیرا محتوای فید را نیز فیلتر می کند.
				</p>
			</div>
		</div>
		
		<div class="av-help-sec">
			<div class="q">
				<p>چگونه یک فایل مخصوص اعضای ویژه در سایتم قرار دهم؟</p>
			</div>
			<div class="hdn a">
				<p>برای اینکار شما باید ابتدا از منوی فایل های محافظت شده، فایل مورد نظر خود را آپلود کنید.<br/>
				بعد از آپلود فایل در ردیف فایل در جدول فایل های آپلودی، ستون آخر مربوط به کد میانبر فایل است.<br/>
				اگر این کد را شما در برگه و یا نوشته خود قرار دهید، با آدرس دانلود فایل تعویض خواهد شد.<br/>
				هم چنین اگر قصد دارید تا لینک های رایگان را برای اعضای معمولی فعال کنید، باید از تنظیمات افزونه "فعال بودن دانلود رایگان" را روی فعال کردن قرار دهید.<br/>
				هم چنین از فیلد "حداکثر سرعت دانلود رایگان" در تنظیمات افزونه می توانید حداکثر سرعت دانلود برای اعضای رایگان را مشخص کنید.
				</p>
			</div>
		</div>
		
		<div class="av-help-sec">
			<div class="q">
				<p>چگونه اطلاعات وی آی پی کاربر فعلی سایت را نمایش دهیم؟</p>
			</div>
			<div class="hdn a">
				<p>
					برای اینکار افزونه چند کد میانبر را برای شما فراهم کرده است.<br/>
					<code>[current-user-vip-start-jalali-date]</code>: نمایش تاریخ شروع حساب کاربری ویژه به شمسی<br/>
					<code>[current-user-vip-start-human-date]</code>: نمایش تاریخ شروع حساب کاربری ویژه به مقدار گذشته<br/>
					<code>[current-user-vip-expire-jalali-date]</code>: نمایش تاریخ پایان حساب کاربری کاربر فعلی به شمسی<br/>
					<code>[current-user-vip-expire-human-date]</code>: نمایش تاریخ پایان حساب کاربری کاربر فعلی به مقدار مانده<br/>
				</p>
			</div>
		</div>
		
		<div class="av-help-sec">
			<div class="q">
				<p>چگونه تعداد تمام کاربران وی آی پی را در سایتم نمایش دهم؟</p>
			</div>
			<div class="hdn a">
				<p>
					برای اینکار افزونه یک کد میانبر را برای شما فراهم کرده است.<br/>
					<code>[all-vip-members-count]</code>
				</p>
			</div>
		</div>
		
		<div class="av-help-sec">
			<div class="q">
				<p>چگونه از افزونه در هاست دانلود استفاده کنم؟</p>
			</div>
			<div class="hdn a">
				<p>
					بسیاری از سایت های دانلود محتوای خود را در هاست های دانلودی قرار می دهند که فاقد دیتابیس MYSQL بوده و نمی توان سیستم وردپرس را روی آنها نصب کرد.<br/>
					عملکرد این قابلیت به این صورت است که شما ابتدا پوشه ای را در هاست دانلود خود آپلود می کنید که فایل های این پوشه وظیفه بررسی وی آی ی پی بودن کاربر در سایت وردپرسی شما را دارند.<br/>
					برای اینکار پوشه ای که با نام remote در پوشه افزونه است را در روت هاست دانلود خود کپی کنید.<br/>
					سپس پوشه را باز کرده و فایل config.php را با یک ویرایشگر باز کنید و طبق راهنمایی که برای هر خط آن است فایل را ویرایش کنید.<br/>
					حال برای استفاده از سرویس، ابتدا فایل ها خود را در پوشه ای که در فایل config.php تعریف کرده اید آپلود کنید.
					<br/>
					سپس فایل های خود را در پوشه ای که در فایل config.php تعریف کرده اید آپلود کنید. برای دسترسی وی آی پی به فایلی که با نام test.zip در پوشه فایل ها آپلود کرده اید آدرس زیر را وارد کنید:<br/>
					<code>http://ADRESS HOST DOWNLOAD SHOMA/download.php/test.zip</code><br/>
					برای دانلود رایگان فایل هم پسوند free را به آخر فایل اضافه کنید:
					<br/><code>http://ADRESS HOST DOWNLOAD SHOMA/download.php/test.zip/free</code><br/>
					<br/>
					دقت کنید برای استفاده از این قابلیت باید ماژول CURL در هاست دانلود شما فعال باشد. این ماژول در اکثر سرور ها فعال است، برای اطلاع از فعال بودن این ماژول می توانید از مدیر هاست خود سوال کنید.
				
				</p>
			</div>
		</div>
		
		
		
	</div>



<?php } 